[ {
  "Post Author" : "Vanessa Vega",
  "Post URL" : "https://www.facebook.com/groups/616339398898678/posts/2135128507019752/?__cft__[0",
  "Post Content" : "My boyfriend's H1B is pending for a long time, and he cannot work anymore due to that. What are the best paths he can take?",
  "Post Date" : "2d",
  "Number of Likes" : "2",
  "Number of Comments" : "28",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi All,\nBoth H-1B and H-4 visas were prudentially revoked under 221(i) due to a past record of the H-1B holder.\nBoth the H-1B holder and H-4 holder are currently in the U.S., and the H-1B holder cannot travel for stamping right now due to work constraints.\nThe H-4 holder needs to travel to India for an urgent situation.\nIn this scenario, can the H-4 attend the visa interview independently without H1b, given that both visas were revoked?\nAny recent experiences or insights would be appreciated.",
  "Post Date" : "1h",
  "Number of Likes" : "2",
  "Number of Comments" : "11",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I had my H1B extension stamping interview in Chennai on December 18th. The Visa Officer kept my passport and issued a 221(g) form, requesting that I make all my social media handles public. Since then, my status in CEAC has remained 'Refused.' Has anyone else experienced a similar situation?",
  "Post Date" : "5h",
  "Number of Likes" : "2",
  "Number of Comments" : "14",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Just received an email from Chennai consulate on Visa Revocation notice.\nDear U.S. Visa Holder,\nPlease be advised that your U.S. visa has been PRUDENTIALLY REVOKED under section 221(i) of the Immigration and Nationality Act by the U.S. Department of State on 30-DEC-2025. This action is based on the fact that after visa issuance, information has come to light indicating that you may be inadmissible to the United States and ineligible for your visa.\nI had a false arrest records which was dismissed even before court appearance and totally removed from records. I had multiple job changes and H1b transfers and stamping in India and Dropbox, never got any issues, just 1st time comsular officer asked documents to prove arrest was dismissed, now suddenly this happened after 8 years\nI recently got offer from another company and they filed visa transfer for me 10 days ago in premium processing. Did this triggered my visa revocation? I had stamping till 2027 Feb, now that also gone, will this also deny my H1b transfer in USA considering I am here? I am supposed to start working for new company in first week of January, can I still do that on receipt notice or this will surely get denied?\nPlease advise, words looks scary.",
  "Post Date" : "10h",
  "Number of Likes" : "15",
  "Number of Comments" : "62",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I recently got visa stamp renewed. Can I make my social media private now? I don't feel comfortable having my pictures and information accessible to public. Will there be any issues on PoE if I make my social media private?",
  "Post Date" : "4h",
  "Number of Likes" : "7",
  "Number of Comments" : "15",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi, I am in F1 STEM OPT.\nMy current employer does not sponsor H1B visas.\nWhat are my other alternatives?\nI am thinking of filing H1B from a consultancy and transferring it.\nDoes that work?",
  "Post Date" : "1h",
  "Number of Likes" : "1",
  "Number of Comments" : "5",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Any one in this group recently moved back to India permanently and have withdrawn amount fully from 401K before 60 years? Can any one pls tell me their experience. I have around $90K in my 401K account and my BOA account is linked as well for direct deposit. Now if I withdraw before going to India here only I heard there will be 10% penalty and 30% mandatory withholding from non residents. So amount after deduction will be $54K. Is this correct?",
  "Post Date" : "17h",
  "Number of Likes" : "10",
  "Number of Comments" : "30",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hello Everyone,\nI'm seeking advice regarding international travel. I am currently on an H-1B visa, my wife holds a Green Card EAD and Advance Parole, and our children are U.S. citizens. We are planning a vacation to Cancun, Mexico during the first week of February. Is it permissible for us to travel outside the U.S. for this trip?",
  "Post Date" : "2h",
  "Number of Likes" : "1",
  "Number of Comments" : "2",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "YellowPomelo1080",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hello all! I have domestic violence charges, arrest and case got dismissed 2 years ago and I got RFE for my H1B extension. Do I forsee any risk/ rejection for my extension of H1B because of it?\nI am very worried, please help !🙏🏻🙏🏻\nThe RFE is potential law enforcement encounter. Has anyone experienced the same?\nWhat documents I can submit to support my case.\nThank you so much !",
  "Post Date" : "1w",
  "Number of Likes" : "11",
  "Number of Comments" : "36",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Anyone attended H1B stamping interview in Karachi, Pakistan and was issued 221g for social media. How long it took to get it processed? Appreciate responses.",
  "Post Date" : "1h",
  "Number of Likes" : "3",
  "Number of Comments" : "13",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "What happens when employee initiates for a h1 transfer process to a new company with the approved i797 from the current company and before the new petition gets approved what if the current employer revokes the current petition?\nWill the employees h1 transfer still gets approved?\nPlease advise....",
  "Post Date" : "13h",
  "Number of Likes" : "4",
  "Number of Comments" : "4",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I discovered I have a terminal illness. I am in the midst of a divorce and because of the financial retraining order I am not able to leave anything for my parents in India. I have no kids and the divorce doesn't look like it will finalize anytime soon. If I create a will and trust in USA, how can I make sure it reaches my parents in India? Thanks.",
  "Post Date" : "1d",
  "Number of Likes" : "37",
  "Number of Comments" : "37",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Question about Visa Revocation:\nHi All,\nPlease advise if anyone had their visa revocation for traffic ticket (failure to stop at red light) issue.\nNo finger print or biometrics taken.\nI didn't contest the ticket and paid the fine per court notice.\nI had my visa stamped back in April in Canada and i am planning to visit india.\nThank you!",
  "Post Date" : "11h",
  "Number of Likes" : "4",
  "Number of Comments" : "17",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I am an OPT student received local government job offer, any realistic path to sponsorship?\nI'm looking for some advice and perspective on a situation I'm currently in.\nI'm an F-1 student on OPT. My OPT started on Sept 1, 2025 and ends in Aug 2026. I recently received an offer from a local county government office in South Carolina for a contract/procurement-related role. I visited the office in person, met the team, and as far as I know, I would be the only international employee there.\nThe tricky part is visa sponsorship.\nThey did not ask about visa status or sponsorship during the interview process, but they did complete a background check (credit + criminal) before issuing the offer. From my understanding, this county typically does not sponsor H-1B, and I know government sponsorship can be rare. That said, my OPT clock is ticking and I don't really have the luxury of waiting much longer.\nI'm trying to understand:\n• Is there any realistic way to approach a local government employer about:\n• STEM OPT, or\n• H-1B\n• Has anyone successfully navigated sponsorship with a county or municipal employer?\n• Is it common for government employers to overlook visa discussions early and then address it later, or is that usually a red flag?\n• Would it make sense to accept the offer on OPT and revisit sponsorship later, or is that too risky?\nI'm genuinely interested in the role and the team seemed supportive, but I also want to be realistic and not put myself in a dead end situation immigration wise.\nAny insights, experiences, or hard truths are appreciated. Thanks in advance.",
  "Post Date" : "1d",
  "Number of Likes" : "4",
  "Number of Comments" : "17",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Have received an RFE for my i140. The attorneys are working on the response for the RFE. Meanwhile I have a planned trip to India which includes the Visa stamping interview as well. Wanted to check if the RFE here would be of any concern when attending the stamping interview.",
  "Post Date" : "2h",
  "Number of Likes" : "1",
  "Number of Comments" : "7",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hello Guys   \nNeed more updates on visa appointments are still rescheduling??   \nI want to book H4 Visa appointment in April 2026\nHello Guys   \nNeed more updates on visa appointments are still rescheduling??   \nI want to book H4 Visa appointment in April 2026",
  "Post Date" : "3d",
  "Number of Likes" : "1",
  "Number of Comments" : "12",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi, I am working on a H1B visa for the last couple of months. My spouse and kid just joined me in the US a couple of days back. I had requested my employer to add them as dependents on the insurance policy. As proof of submission I had provided Renter's Insurance copy after adding my spouse's name on it. Currently I do not have my spouse added to the active lease agreement. Is it mandatory to have the spouse name added on the active lease agreement as well or just adding on the Renter's Insurance copy is fine ?",
  "Post Date" : "1d",
  "Number of Likes" : "3",
  "Number of Comments" : "3",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi All, Is it safe to travel to India right now considering all these visa situations? I have my H-1B stamped until May 2026. Im planning to go in January and returning in February. Would there be any problem returning at the port of entry?\nThanks!",
  "Post Date" : "1d",
  "Number of Likes" : "5",
  "Number of Comments" : "5",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I have an approved I-140 under EB3 Skilled, and I am waiting for my priority date (August 29, 2023) to become current so I can file the I-485. In the Visa Bulletin, the EB3 Skilled filing date is June 1, 2023, and it has not moved in several months.\nIf I apply for EB2 NIW and get approval, would that allow me to file the I-485 sooner under the EB2 category using the same priority date? Or should I stick with EB3 and wait for my priority date to become current to file the I-485 under my existing EB3 I-140?\nPlease advise.... Thanks :pray:",
  "Post Date" : "16h",
  "Number of Likes" : "3",
  "Number of Comments" : "12",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I travelled to India from US on Dec 12 due to personal emergency.\nWhile checking my i94 I realised it was expired on dec 5 as my old passport expired on this date. I have stamped visa, valid i797 till November 2026. Can I return to US without any issues on dec 31?\nThank you in advance!",
  "Post Date" : "2w",
  "Number of Likes" : "8",
  "Number of Comments" : "40",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi\nI have a question regarding the DS‑160. We completed our DS‑160 in November and are still looking for a visa appointment slot. We have not booked any appointment yet, and I realized that I did not include all of my social media accounts in the application --- only my Facebook account was listed.\nI have two questions:\nHow can I update my DS‑160 to include all of my social media accounts?\nHow can I ensure that my DS‑160 and the visa fee payment remain valid while I continue searching for an appointment slot?\nThanks in advance for your response.",
  "Post Date" : "19h",
  "Number of Likes" : "2",
  "Number of Comments" : "2",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "TaupeBroccoli3163",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "usvisascheduling\nFrom past few days when am try to login to usvisascheduling.com\nAfter login am getting below :point_down: error\n\"Unable to authenticate with the external account provider.\"\nI try to clear cache browser and network. Still the same error. Anyone facing the same issue ?",
  "Post Date" : "11h",
  "Number of Likes" : "2",
  "Number of Comments" : "4",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "My Colleague has a family emergency and need to travel to India.\nHe has I-797 but need to get h1b stamping to come back to US. Any recommendations if the emergency h1b visa stamping slots are open?\nThank you!",
  "Post Date" : "11h",
  "Number of Likes" : "5",
  "Number of Comments" : "5",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Is it safe to travel to India and come back in 3 weeks, I am on L1 and visa valid till Feb'27.",
  "Post Date" : "2d",
  "Number of Likes" : "8",
  "Number of Comments" : "34",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "#Regarding upcoming visa stamping . My visa appointment is scheduled on jan 22 2026 and jan 27 respectively for biometric and consulate in chennai i am on h4 and planning to travel alone with two kids age 4 and age 6 my husband who is on h-1b will not be travelling due to current visa scenario . His visa is not stamped.Anyone who is in same boat can you share your experience as i am still in two minds what if i get stuck. Are the appointments still getting rescheduled for January as for me my appointment has not changed.\nAny suggestion will be greatly appreciated. Thanks",
  "Post Date" : "10h",
  "Number of Likes" : "1",
  "Number of Comments" : "2",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I am on H1 visa and came to India on Dec 3 for stamping. My spouse and kid on H4 was still in US. Unfortunately, my interview was rescheduled to April. My company is temporarily shifting me on Indian payroll.\nIf I am going on Indian payroll, will my wife and kids H4 status will be invalid and they have to return ?",
  "Post Date" : "1d",
  "Number of Likes" : "16",
  "Number of Comments" : "25",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi, can anyone help? I am currently living in USA on H1b visa. I am permanent resident of Canada too. Can I go to Canada for h1b stamping? I am Indian citizen.",
  "Post Date" : "10h",
  "Number of Likes" : "5",
  "Number of Comments" : "5",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "IntelligentFox2237",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "H1B transfer to new employer\nI am currently working with Company A and got a job offer with Company B who will be transferring my H1B. Company B wants my start date to be on March 2nd 2026 -- that will be the start date they will mention on the petition.\nI have a few questions:\n1. Will my current employer be notified as soon as Company B files H1B transfer?\n2. Can I continue working at my current employer, Company A until March 2nd? or should I stop working as soon as H1B transfer is filed by Company B / as soon as H1B transfer is approved by USCIS?\n3. Can I quit Company A as soon as H1B transfer is filed by Company B? Will it accumulate unemployment days between that day and Start date of March 2nd?\nPls advise.",
  "Post Date" : "9h",
  "Number of Likes" : "2",
  "Number of Comments" : "5",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "JoyfulSeal1142",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hey everyone, winning a jackpot in a casino and filing taxes is a problem as an international student? Just curious. Thankyou",
  "Post Date" : "13h",
  "Number of Likes" : "5",
  "Number of Comments" : "5",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Anyone able to book h1b stamping appointment in Nepal. Are appointments getting postponned in Nepal too?",
  "Post Date" : "1d",
  "Number of Likes" : "2",
  "Number of Comments" : "2",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Do you get arrested at your GC interview if you overstay your f1 visa?",
  "Post Date" : "17h",
  "Number of Likes" : "24",
  "Number of Comments" : "35",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Are we getting h1b visa stamping slots for biometric and interview?",
  "Post Date" : "11h",
  "Number of Likes" : "4",
  "Number of Comments" : "7",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Is anyone recived mail for rescheduling appointment now. Are they still rescheduling. Mine is on biometric Jan 27 and interview feb3\nIs anyone recived mail for rescheduling appointment now. Are they still rescheduling. Mine is on biometric Jan 27 and interview feb3",
  "Post Date" : "11h",
  "Number of Likes" : "2",
  "Number of Comments" : "7",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hello everyone\nI got laid off December 8 . My employer filled my h1b transfer with premium processing 12 December (receipt date). But it's Still pending.anyone got H1B transfer approval within this date? Please comment here's thanks.",
  "Post Date" : "3h",
  "Number of Likes" : "2",
  "Number of Comments" : "2",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "How can I get biometric done for my kid who just turned 14 years (Status: H4) here in US?\nHow can I get biometric done for my kid who just turned 14 years (Status: H4) here in US?",
  "Post Date" : "14h",
  "Number of Likes" : "9",
  "Number of Comments" : "9",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hello everyone,\nI am permanently moving to my home country at the end of January 2026. I worked in the US and have simple IRA and Roth IRA. What can I do with these accounts. Also, what about my credit cards. Everything else I can sell off.\nIs there anything else I should be aware of?\nI would greatly appreciate your help.\nThank you",
  "Post Date" : "12h",
  "Number of Likes" : "2",
  "Number of Comments" : "2",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi All member!\nI just want the guidance۔ Recently 4 days ago my 10 year old kid hit by a comercial van on crossings۔ My kid was crossing the road on his bicycle۔ My kid was not at fault also police gave a Ticket to the van driver۔ With the God's mercy on my kid he didn't got hurt just bicycle damaged and his glasses were broken.\nChicago Police gave me driver information exchange card and said every thing is on portal it will help you for lawyer case.\nI don't know what to do because I was not involved before in any of these cases. I am on H1 and my kid is on h4 visa.\nPlease guide me.",
  "Post Date" : "1d",
  "Number of Likes" : "13",
  "Number of Comments" : "24",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Anyone facing any issues coming back with existing stamped visa while traveling . My h1b visa expires in june 2026\nthank you!!",
  "Post Date" : "6h",
  "Number of Likes" : "1",
  "Number of Comments" : "7",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "OrangeGuava4261",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi everyone,\nI'm an H-1B visa holder (visa stamped till 2027) and planning my first cruise from Florida with family (considering Wonder of the Seas).\nI wanted to check:\n• How the port of entry is done on a cruise? What documents are required for re-entry into the U.S.?\n• Any first-time cruise experiences or tips for H-1B holders would be really helpful.\nThanks in advance!",
  "Post Date" : "3d",
  "Number of Likes" : "4",
  "Number of Comments" : "18",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi All,\nI have a 401K account which has approx $70K and I m 44 years age. Now if I decide to move back to India next year I want to understand how can i withdraw this money? I heard it's advised to withdraw money once I reach 60 years but my question is whom to contact that time and how that process works if any one has any experience? I might not be with same employer in India so want to understand the steps here if any one can explain on withdrawal of 401K money.",
  "Post Date" : "18h",
  "Number of Likes" : "33",
  "Number of Comments" : "64",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I'm a student and I was recently in a car accident in Florida and could really use some guidance. I was driving through an intersection on a green light when another driver ran a red light, hit my car on the left passenger side, and then ran, leaving their car behind. Police came to the scene, a crash report was filed, and I was not at fault. Thankfully, there was a witness who spoke with the police and explained what he saw. My car is a 2024 Toyota Camry, the airbags deployed, and the vehicle was towed,I have GEICO insurance. At the scene I said I felt okay, but I haven't had a medical evaluation yet. As a student without a stable income, this situation is really tough financially. I'm trying to understand what steps I should take next with insurance, whether I should still get checked medically, how rental cars usually work, what to watch out for during the claims process, and how to handle things without straining financially. Any advice or similar experiences would really help --- thank you.",
  "Post Date" : "1d",
  "Number of Likes" : "8",
  "Number of Comments" : "16",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Port of Entry -- STEM OPT Visa Revoked with 5 Years BAN\nNothing to Scare People here, Just Sharing my Personal Story if it helps anyone with similar situation. (Expecting Negative Comments, but it's no less than what I went through last 4 days)\n· Visa Status = F1 STEM OPT (with 13 Months left)\n· Job Type = W2\n· End Client = Top Telco in the USA\n· W2 Employer = Desi Prime Vendor of the Telco (Can be Found on Telco Website)\n· Active Job = Yes (with 13 Months more Contract Period)\n· Client Letter = Yes\n· Job Active From = 20 Months (with Genuine Pay Slips and W2s)\n· Reason for Travel = Visiting my (old) Parents after being 4 years in USA\n· My Profile = 11 Years of Real Experience with 6 Years of International Experience + One of the highest CGPAs in Masters\n· Pre-Travel = Deleted all the un-wanted and un-necessary information from the phone (2 weeks in prior)\nPOE Experience --\n· Date of POE = December 24\n· POE Location = Atlanta (via Doha)\n· Flight = Qatar Airways\n· Documents Carried = Travel I20, OPT EAD Card , Client Letter, Pay Slips , Offer letter, Extension Letter, I-983 (latest)\n· Any Known Mistakes = Worked on a Side gig for 2 months during Masters, during my Car Accident -- in Order to pay off my car Expenses (When my savings didn't support and to avoid asking accident costs from Parents ) . Definitely I am not lying.\nPOE Experience - My Story -\n1. Landed in Airport with a positive hope. Waiting time for less than 2 minutes, Greeted Good Afternoon to Immigration Officer and he asked for my I20 and asked to, Keep my 4 fingers on the Scanner\n2. Immigration Officer handed my passport and I20 to another Officer and the person asked me to follow him to the secondary inspection\n3. I was handed to 3rd and 4th Immigration /CBP Officers , Where I was asked handover what all items I have on me (Phones, Mac, Wallet , Documents, Watch, Everything) and Asked me to sit\n4. 3rd officer called again and asked to Share Phone Passwords and asked me to go back and sit\n5. After 75 Mins of Waiting time, 3rd and 4th Officer called back and asked to share all the truth on my journey in USA\n6. I was very confident on my Homework and mentioned that I was clean , Despite Officer asked a couple of times (As friends suggested not to claim anything if not asked)\n7. Prosecution-- Officer took all my details under Voice Recording from Day 1 of Applying to Masters, to First POE in 2022 and till December 23 2025. Stressing the 2 months of Side Gig job and Hours I Spent each day.\na. Catch 1 - 3rd officer showed all the deleted chats of my Side Gig During the masters during the 2 months (Feb and March 2023), Which left me in a blurred situation and when Officers has raised their voices, and Showed Handcuffs, I had to obey my Mistake.\nb. Catch 2 -- After completion of Masters, I took CPT via a desi Consultancy, Where I have received couple offers but later the position was kept on Hold and I was left with no Job during the 4 months of CPT (Officer Found my 1st Desi consultancy as Blacklisted)\nc. Catch 3-- After CPT, I applied for OPT via another Desi Consultancy, When the Market is tough and hardly got any calls. But due to my experience and Background, I received Interviews Scheduled for Walmart (1 Months-3 rounds) and Amazon (2 months -- 3 Rounds + 1 Loop Round) , Both rejected after the Final Rounds. I wasted 3 months of my OPT with No Job. But 4th Month I got a Job from the big Telco with prime vendor on W2. (officer Found the 2nd Consultancy is flagged and Blacklisted)\nd. Catch 4 -- Despite having 20 months of genuine Experience + Contract Letters + Pay Slips + Client Letter from Telco. Office mentioned that the 3rd Consultancy/W2 Vendor is flagged as blacklisted)\n8. 3rd Officer Took Everything Recording and took his notes, Officer said because all the companies that worked for are blacklisted and also because of the side gig I performed, He wanted to arrest and take me into custody.\n9. After sharing the achievements in the university and my Experience and Appraisals received in the first job at the telco and University, Officer agreed to Let me go with 5 year BAN to the USA , With an emergency out of Country Orders.\n10. I was Booked with an immediate next Qatar flight , My Mobile Phones and Passports were handed over to the next Qatar Airways Administration and I was handed only with the rest of the luggage.\n11. I was treated as a Murderer/ Criminal from December 24 to December 26 (Without my Documents and phone), till the time I was landed into the home country. (end of my Story...)\nNotes --\n1. Negative comments are welcome, As I cannot change my Circumstances and situations back in 2023 and also I Don't know which desi Consultancies are black listed in the CBP Portal , I tried every single moment to perform the best in the limited interviews from my OPT Status but I think GOD just had a different Plan.\n2. If you can read through my story, People in similar situation can avoid the mistakes or can prepare something to avoid the mistakes which I did.\nI have couple of questions , If anyone can genuinely help -- (Any one Prior Experienced, any Attorney Or People who moved out of USA with similar Situation )\n1. Is there any way I can request to remove the 5 year BAN ? Any Attorney who i can speak to ?\n2. With 5-year BAN , Can I ask travel for any other country for a Work opportunity ? (Example -- Canada, Australia, Germany) , I understand the 5 eyes Rule, But What are the chances.\n3. If I can explore Job opportunities in any other country , What countries would not consider the USA Data (or) What countries will allow to work. ?\na. I am currently applying opportunities at my home Country , but If I can look out for Abroad opportunities then which one I can apply for ?\n4. Will I have issues with Traveling any other country, on a tourist Visa ?\nNeed some guidance after all the nightmare I went through , Hoping for some Support\nThank you,",
  "Post Date" : "4d",
  "Number of Likes" : "167",
  "Number of Comments" : "185",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi, I applied for H1, H4 and H4 EAD in premium processing on 11/28. Didn't receive the receipt for H4 EAD yet but amount got deducted. H1 approved on 12/16, no status update on H4 and not sure about the EAD. Any idea when the H4 EAD receipt will be sent and how long H4/H4 EAD would take for approval after H1 approval?",
  "Post Date" : "8h",
  "Number of Likes" : "1",
  "Number of Comments" : "1",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi! My h1b got approved after a 221g in Pakistan,Karachi on Dec 20th. How long should it take for it to be issued since I have a flight soon?",
  "Post Date" : "1d",
  "Number of Likes" : "2",
  "Number of Comments" : "5",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : ":rotating_light: URGENT -- Please advise :rotating_light:\nHi everyone,\nI'm looking for urgent guidance from anyone who has faced a similar situation.\nTimeline:\n* I was on H-1B and lost my job on August 27, 2025\n* Within the 60-day grace period, I filed and moved to H-4\n* H-4 extension was filed on September 25, 2025 (still pending)\n* I received a new job offer in December 2025\n* Employer filed H-1B Change of Status (H-4 → H-1) in premium processing on December 10, 2025\n* My I-94 expires on January 5, 2026\n* USCIS issued an RFE stating they cannot adjudicate the H-1 COS while the H-4 application is still pending\nMy concern is that H-4 approvals are currently taking 6+ months, and I may lose my job if I have to wait for H-4 approval first.\nI'm also worried that depending on how the RFE is answered, USCIS may push the case to consular processing, which would require travel to India, where visa appointment dates are very limited and the process is a major hardship.\nQuestions (URGENT):\n* Has anyone faced this exact situation where H-1 COS was blocked due to pending H-4?\n* After responding to the RFE, did USCIS adjudicate the H-4 first and then approve H-1 COS without forcing consular processing?\n* Did anyone successfully avoid consular processing in a similar scenario?\nAny real experiences or guidance would be greatly appreciated :pray:",
  "Post Date" : "1d",
  "Number of Likes" : "8",
  "Number of Comments" : "9",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/groups/616339398898678/posts/2134068777125725/?__cft__[0",
  "Post Content" : "Paternity Leave on H1B\nHello Everyone, I am on H1B and my wife's due date is in next week. I wanted to know what kind of leave i should apply for ? Should I ask for PTO or FMLA or something else? Will the unpaid leave create an issue for my H1B status.\nThanks",
  "Post Date" : "4d",
  "Number of Likes" : "1",
  "Number of Comments" : "12",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hello,\n1. My current H-1B visa stamp is valid until Sept 2026. After changing employers in Nov 2024, I received a new approved I-797 with attached/paper I-94 valid until Sept 2027. I'm planning a ~5-week trip to India in late January and haven't traveled since the job change. Do I need a new visa stamp since the current one has my old employer, and is it a good time to travel?\n2. If I travel and re-enter the U.S., will CBP update my...",
  "Post Date" : "15 hours ago",
  "Number of Likes" : "0",
  "Number of Comments" : "5",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "SoftHedgehog5861",
  "Post URL" : "https://www.facebook.com/groups/616339398898678/user/1607604760591099/?__cft__[0",
  "Post Content" : "My wife had h4 interview today. She received 221(g) form. Her passport were kept by embassy. Consulate said she should get decision by next week. Is this normal or something need to be worried",
  "Post Date" : "a day ago",
  "Number of Likes" : "14",
  "Number of Comments" : "28",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Myself and spouse have individual H1Bs and kid is H4 under my spouse..For me stamp is valid till mid of 2026 but stamp has expired for my spouse and kid..Is there any option kid can travel with me without my spouse? As kid is minor and doesn't have a social media..For minors how is this handled? Or since he is dependent of my spouse, he can't get stamped without my spouse??",
  "Post Date" : "21 hours ago",
  "Number of Likes" : "1",
  "Number of Comments" : "5",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "My PERM and I-140 recently got approved. Could you let me know which documents ( both hard and soft copies) are to be received from my employer?",
  "Post Date" : "a day ago",
  "Number of Likes" : "1",
  "Number of Comments" : "12",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "My spouse is looking for Finance/Accounting job on initial Opt..any leads or reference will be appreciated.",
  "Post Date" : "13 hours ago",
  "Number of Likes" : "0",
  "Number of Comments" : "0",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Dear All,\nI have h1 with 2027 validity working in USA. I have travel plan on March 2026. I can see some posting that even with validity of visa people are restricted in POE. Is it true? Any recent travelers in this group? Please share your experience\nThanks",
  "Post Date" : "22 December at 19:45",
  "Number of Likes" : "4",
  "Number of Comments" : "10",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Anyone recently travelled to Cancun and came back on stamped H1B visa? how was the PoE experience while coming back?",
  "Post Date" : "2 days ago",
  "Number of Likes" : "1",
  "Number of Comments" : "7",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I have a few questions regarding the H-1B visa interview process and would really appreciate any insights from those who have experience.\n• If I submit my DS-160 now but am unable to get an interview slot for about a year, what happens next? Would I need to submit a new DS-160, or can the existing one still be used?\n• Can I attend the visa interview at a different U.S. consulate within my country, or am I restricted to the one initi...\nSee more",
  "Post Date" : "15 hours ago",
  "Number of Likes" : "0",
  "Number of Comments" : "1",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "CharmingLizard1128",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Help me on this ..\nMy H-1B grace period ends on 13th.\nIf the attorney files the H-1B transfer petition on 8th, but I do not receive the receipt notice before 13th, is it still okay for me to stay in the U.S.?\nAlso, is it mandatory to be on payroll before the grace period ends?\nSee more",
  "Post Date" : "15 hours ago",
  "Number of Likes" : "0",
  "Number of Comments" : "0",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I got the Ad published in news paper after PWD is issued. According to Ad it requires Bachelor + 5 years of experience.\nThe PERM was also submitted where I provided all 15 year of experience.\nHow I come to know it is EB2, As per employeer it is EB2.",
  "Post Date" : "18 hours ago",
  "Number of Likes" : "1",
  "Number of Comments" : "3",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "My employer has been deducting insurance amount from my check. Later, I found that the insurance has been inactive for 2 months. Upon checking my employer, he said they ran into some issue and they are working on a fix with insurance company. After that, I have asked multiple times but he hasn't been confirming how long will it take to get this fixed. I have a medical condition and need medicines on regular basis which I'm not able to...\nSee more",
  "Post Date" : "18 hours ago",
  "Number of Likes" : "1",
  "Number of Comments" : "5",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I have a valid **L1 visa until 2027** and my **PD Action Date is current**, but I have not yet received my **AP and EAD**. I need to travel to **Canada for business purposes**. Please let me know if anyone feels this may not be a good idea at this stage.",
  "Post Date" : "21 hours ago",
  "Number of Likes" : "1",
  "Number of Comments" : "2",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Anyone who did medical recently for 485? I need to check something for the vaccine section. Please leave a comment n I will inbox you",
  "Post Date" : "a day ago",
  "Number of Likes" : "0",
  "Number of Comments" : "4",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Humbleh1b",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Does anyone get petition approval for H1B from 2025 lottery? My application was submitted in June, yet no update.  \nDoes anyone get petition approval for H1B from 2025 lottery? My application was submitted in June, yet no update.",
  "Post Date" : "2 days ago",
  "Number of Likes" : "1",
  "Number of Comments" : "14",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Deepa Srikant",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "#### **Hello Everyone,**\n\nMy passport is valid for 15 months. I am applying for visa extension on premium processing. Would the fact that my passport validity remaining approximately 15 months affect the length of my visa extension? I mean will extension be granted for 3 years still? I cannot apply for passport renewal before 12 months of expiry. Did anyone go through this experience? Please let me know how you handled the situation.  \nThank you in advance!",
  "Post Date" : "21 hours ago",
  "Number of Likes" : "0",
  "Number of Comments" : "7",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "GoldZebra7749",
  "Post URL" : "https://www.facebook.com/groups/616339398898678/user/1103019785142396/?__cft__[0",
  "Post Content" : "Please help me out!\nHello everyone, need assistance. My i94 online was expired may 14 2025 along with my old passport, my address change amendment was filed in early May but the received date on i797c shows may 20, 2025. Its still under processing.\nHaven't traveled out of country in 2 yrs. My current h1b i797a is valid until march 2026. ...\nSee more",
  "Post Date" : "2 days ago",
  "Number of Likes" : "2",
  "Number of Comments" : "8",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi, for some reasons H1 has to leave US, can H4 change to B2 with dependents and stay till the kids complete schooling?",
  "Post Date" : "a day ago",
  "Number of Likes" : "",
  "Number of Comments" : "4",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Quick question: If the primary H1B holder is laid off and enters the 60-day grace period, does the H4 EAD spouse have to stop working immediately? The EAD card expiration date is not an issue (it's valid for a long time).\nJust trying to confirm if the \"Grace Period\" protects the H4's work authorization as well. Thanks.",
  "Post Date" : "23 hours ago",
  "Number of Likes" : "4",
  "Number of Comments" : "7",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I am going through an extremely difficult time. My mother in law is in her last stage cancer and doctors have said that she doesn't have much time left. I need to leave immediately to support my family as my husband doesn't have stamped visa, so he can't go. I am the only person who has valid stamped visa. Given the current immigration scenario I wanted to ask : will I face any difficulties during re entry with a valid H4 visa? Any g...\nSee more",
  "Post Date" : "3 days ago",
  "Number of Likes" : "31",
  "Number of Comments" : "32",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "My H1B visa is expiring on August 2026 and my company is filing my extension plus Amendment probably in Jan 2026. Once they file the extension can I still travel to Indian with my old stamped visa in February or March?",
  "Post Date" : "23 December at 23:53",
  "Number of Likes" : "",
  "Number of Comments" : "4",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "ProficientHamster9383",
  "Post URL" : "https://www.facebook.com/groups/616339398898678/user/1988444381733644/?__cft__[0",
  "Post Content" : "My H-4 EAD was approved about two weeks ago, and I selected 'Yes' for SSN issuance on the I-765. How long did it take for SSN card to arrive after approval? Do we receive it automatically, or do we have to follow up with SSA?\nThank you for your time and response.",
  "Post Date" : "2 days ago",
  "Number of Likes" : "2",
  "Number of Comments" : "2",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "**EB-2 NIW**\nI'm currently on my last year of H1B and considering applying to Eb2 NIW. I have bachelors degree from US university with 8+ years of experience. My work directly aligns with SCADA/ electric grid modernization which aligns with National intrest.\nI took evaluations from a few law firms and here is what they said\nSee more",
  "Post Date" : "a day ago",
  "Number of Likes" : "5",
  "Number of Comments" : "8",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "**Does anyone who applied for H1B extension(normal processing )In Jul2025 got approval?**",
  "Post Date" : "2 days ago",
  "Number of Likes" : "8",
  "Number of Comments" : "45",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anna21528",
  "Post URL" : "https://www.facebook.com/groups/616339398898678/user/1358182482710431/?__cft__[0",
  "Post Content" : "I recently gave my H1B renewal visa interview in Chennai consulate on 11/02, and received 221G where it was not a matter of any questions.\nI had a domestic battery case 5 years ago, which got dismissed the same week in court, and I also got cleared from consulate interview same year.\nBut this time again, officer asked me questions about the same case, and said, he had everything in the system, but still gave me the white slip. Does anyone know how much time it usually tak...\nSee more",
  "Post Date" : "23 December at 04:16",
  "Number of Likes" : "17",
  "Number of Comments" : "63",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "PK Jala",
  "Post URL" : "https://www.facebook.com/groups/616339398898678/user/100014781041972/?__cft__[0",
  "Post Content" : "H1b premium transfer submited with paper to Texas center on 18 but till now did not receive receipt from USICS. Usually how much time it take to get receipt. Grace period clock will stop on USICS issuing receipt or whenever USICS receive my case from fedex??",
  "Post Date" : "23 December at 04:16",
  "Number of Likes" : "1",
  "Number of Comments" : "7",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "GrayGiraffe8532",
  "Post URL" : "https://www.facebook.com/groups/616339398898678/user/1237114971600434/?__cft__[0",
  "Post Content" : "Please, I really need the guidance from someone familiar with the process of going from H1B to F1. What college? Did you do COS inside or outside the US?",
  "Post Date" : "a day ago",
  "Number of Likes" : "0",
  "Number of Comments" : "4",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi, Quick question on H-1B travel. My visa stamp is valid until August 2026, and I'm planning to travel internationally in April/May (so a few months left on the stamp). I also have a new approved I-797.\nIs it generally okay to travel with only a few months left on the visa stamp? Anything specific I should keep in mind for re-entry? Thank you so much in advance.",
  "Post Date" : "a day ago",
  "Number of Likes" : "1",
  "Number of Comments" : "1",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "A friend of mine in H1-B visa will be getting laid off in 10 days, her husband was laid off a few months back and still looking for job. He was also on H1-B, after lay off his company has revoked his H1-B. They have GC-EAD ( valid till 2029) and friend is primary with her husband being the derivative. Their priority date is Jul 2014. Her husband trying for jobs in GC-EAD but not able to find a job due to current market conditions. The...",
  "Post Date" : "2 days ago",
  "Number of Likes" : "9",
  "Number of Comments" : "15",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "How long does it take the visa status to change from 'Approved' to 'Issued'?\nAt Chennai consulate. Received a 221g and now it changed from refused to approved.\nThank you.",
  "Post Date" : "18 July",
  "Number of Likes" : "0",
  "Number of Comments" : "4",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi, I'm traveling to Pakistan for my visa appointment.\n1. Has anyone heard about any changes for Dec 22nd?\n2. Did anyone go for their appointment on Dec 15th or 16th? How was your experience?",
  "Post Date" : "17 December at 05:02",
  "Number of Likes" : "0",
  "Number of Comments" : "24",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hello, apart from India and China, have other countries also experienced their appointments being rescheduled? Especially if you're from Bangladesh, Pakistan, Sri Lanka etc?",
  "Post Date" : "19 December at 23:00",
  "Number of Likes" : "1",
  "Number of Comments" : "6",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi everyone :wave:\nI'm an Indian citizen on an H-1B work visa, currently in Vancouver, BC. I entered Canada by **Amtrak train** and had a very smooth experience with Canadian immigration.\nI'll be traveling back to **Seattle in the next couple of weeks** and wanted to get some advice. Lately, I've been hearing a lot of stories about more intense U.S. immigration screening (including phone checks, extended questioning, etc.), especially at **airports**.\nGiven that, I'm trying to decide:\nSee more",
  "Post Date" : "a day ago",
  "Number of Likes" : "1",
  "Number of Comments" : "1",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hi everyone,\nI'm a 𝗖𝗮𝗻𝗮𝗱𝗶𝗮𝗻 𝗰𝗶𝘁𝗶𝘇𝗲𝗻 𝘄𝗶𝘁𝗵 𝗮𝗻 𝗮𝗽𝗽𝗿𝗼𝘃𝗲𝗱 𝗛-𝟭𝗕 𝗽𝗲𝘁𝗶𝘁𝗶𝗼𝗻 and had a few questions:\n• Does the $100K fee apply to me if I travel to the USA?\n• Do I need a job offer from the same ...\nSee more",
  "Post Date" : "a day ago",
  "Number of Likes" : "1",
  "Number of Comments" : "7",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "How effective is TCS in securing an onsite placement for a candidate (C3B) who has been released from a project during the year-end period?\nSkillset: Master Data Management in the Capital Markets.",
  "Post Date" : "17 December at 21:30",
  "Number of Likes" : "0",
  "Number of Comments" : "7",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "My dependents visa is pending from last 8 months and case status is showing as case was received in USCIS website, how long it is taking for H4 visa approval ? Please note i received my h1 b visa approval in exactly 7 months.",
  "Post Date" : "a day ago",
  "Number of Likes" : "1",
  "Number of Comments" : "2",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "My h1b extension was filed in May 2025 , my visa expired on Sep 30 2025, USCIS reached out to my employer in the end of November 2025 with set of 20 questions, and for which my employer responded in couple of day and then USCIS reached out to client manager with 12 questions in second week of Decemeber 2025 , Client HR team responded back to USCIS by end of 3rd week of december, all through and till now the petition status remained st...",
  "Post Date" : "a day ago",
  "Number of Likes" : "8",
  "Number of Comments" : "14",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "I have a valid 797A (renewed in December) until late 2028, but my I-94 and H1 are valid until May 2026. Can I travel to India in Feb (return in March)? Is there any issue coming back to US with a stamp that has only 2 months left?\nHow long can I stay in the US with an expired visa stamp? I would appreciate any guidance/recommendations around this.",
  "Post Date" : "a day ago",
  "Number of Likes" : "0",
  "Number of Comments" : "8",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "#### **Hi all -**\n\nMy question is regarding whether the $100k fee will apply to my situation.\nI am currently in US since few years now on H1b status which is valid till 2028 (visa stamp in passport is expired). I am planning to switch employer in next few months. I do not anticipate travel out of USA anytime soon.\nSee more",
  "Post Date" : "2 days ago",
  "Number of Likes" : "1",
  "Number of Comments" : "3",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hello,\nMy H-1B visa is currently valid until September 30, 2026. My marriage is scheduled for June 2026, and my company planning to file my H-1B extension in April 2026.\nI would appreciate your guidance on the following points:\n1. If my H-1B extension is in a pending status at the time of my wife's H-4 visa interview, will this have any impact on her application, considering that my current H-1B visa will still be valid at that time...",
  "Post Date" : "2 days ago",
  "Number of Likes" : "0",
  "Number of Comments" : "4",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hello, any new grad nurse? I have few questions on which I really need clarity. Thank you.",
  "Post Date" : "a day ago",
  "Number of Likes" : "0",
  "Number of Comments" : "1",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "My current employer is asking to file for H1 while I have a new job offer which I will join in few months due to relocation and family commitments which new employer is ok with, they have already filed for H1 and hopefully will get decisioned by 1st week of January. Will it be ok to let my existing employer file for extension of H1B in case something goes wrong ? Wondering due to current circumstances and govt policy changing on daily basis.",
  "Post Date" : "a day ago",
  "Number of Likes" : "0",
  "Number of Comments" : "0",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Hello everyone,\nI hope you are doing well!\nMy husband and I are planning to go to Puertorico in February. My husband is on h1b and I am on h4. We have valid I-797 but our visas are expired. Is it safe to travel to Pierto rico as it falls under USA terittory....\nSee more",
  "Post Date" : "23 December at 17:27",
  "Number of Likes" : "4",
  "Number of Comments" : "17",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
}, {
  "Post Author" : "Anonymous member",
  "Post URL" : "https://www.facebook.com/?__cft__[0",
  "Post Content" : "Is it true that speeding tickets are being considered during H1 Visa interviews? I'm a bit confused right now. I live in Maryland and have received speeding tickets in the past. I've paid them, but I've never shown up in court or faced any legal consequences. Should I be concerned?",
  "Post Date" : "3 days ago",
  "Number of Likes" : "2",
  "Number of Comments" : "5",
  "Group Name" : "",
  "All Reactions" : "",
  "Comments" : ""
} ]